colinporth/stm32F429disco/Src/main.cpp
#define DBGMCU1_CR_TRACE_MODE_Pos                     (6U)
#define DBGMCU1_CR_TRACE_MODE_Msk                     (0x3U << DBGMCU1_CR_TRACE_MODE_Pos) /*!< 0x000000C0 */
#define DBGMCU1_CR_TRACE_MODE                         DBGMCU1_CR_TRACE_MODE_Msk
#define DBGMCU1_CR_TRACE_MODE_0                       (0x1U << DBGMCU1_CR_TRACE_MODE_Pos) /*!< 0x00000040 */
#define DBGMCU1_CR_TRACE_MODE_1                       (0x2U << DBGMCU1_CR_TRACE_MODE_Pos) /*!< 0x00000080 */

/********************  Bit definition for DBGMCU1_APB1_FZ register  ************/
#define DBGMCU1_APB1_FZ_DBG_TIM2_STOP_Pos             (0U)
#define DBGMCU1_APB1_FZ_DBG_TIM2_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_TIM2_STOP_Pos) /*!< 0x00000001 */
#define DBGMCU1_APB1_FZ_DBG_TIM2_STOP                 DBGMCU1_APB1_FZ_DBG_TIM2_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM3_STOP_Pos             (1U)
#define DBGMCU1_APB1_FZ_DBG_TIM3_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_TIM3_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU1_APB1_FZ_DBG_TIM3_STOP                 DBGMCU1_APB1_FZ_DBG_TIM3_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM4_STOP_Pos             (2U)
#define DBGMCU1_APB1_FZ_DBG_TIM4_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_TIM4_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU1_APB1_FZ_DBG_TIM4_STOP                 DBGMCU1_APB1_FZ_DBG_TIM4_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM5_STOP_Pos             (3U)
#define DBGMCU1_APB1_FZ_DBG_TIM5_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_TIM5_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU1_APB1_FZ_DBG_TIM5_STOP                 DBGMCU1_APB1_FZ_DBG_TIM5_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM6_STOP_Pos             (4U)
#define DBGMCU1_APB1_FZ_DBG_TIM6_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_TIM6_STOP_Pos) /*!< 0x00000010 */
#define DBGMCU1_APB1_FZ_DBG_TIM6_STOP                 DBGMCU1_APB1_FZ_DBG_TIM6_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM7_STOP_Pos             (5U)
#define DBGMCU1_APB1_FZ_DBG_TIM7_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_TIM7_STOP_Pos) /*!< 0x00000020 */
#define DBGMCU1_APB1_FZ_DBG_TIM7_STOP                 DBGMCU1_APB1_FZ_DBG_TIM7_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM12_STOP_Pos            (6U)
#define DBGMCU1_APB1_FZ_DBG_TIM12_STOP_Msk            (0x1U << DBGMCU1_APB1_FZ_DBG_TIM12_STOP_Pos) /*!< 0x00000040 */
#define DBGMCU1_APB1_FZ_DBG_TIM12_STOP                DBGMCU1_APB1_FZ_DBG_TIM12_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM13_STOP_Pos            (7U)
#define DBGMCU1_APB1_FZ_DBG_TIM13_STOP_Msk            (0x1U << DBGMCU1_APB1_FZ_DBG_TIM13_STOP_Pos) /*!< 0x00000080 */
#define DBGMCU1_APB1_FZ_DBG_TIM13_STOP                DBGMCU1_APB1_FZ_DBG_TIM13_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_TIM14_STOP_Pos            (8U)
#define DBGMCU1_APB1_FZ_DBG_TIM14_STOP_Msk            (0x1U << DBGMCU1_APB1_FZ_DBG_TIM14_STOP_Pos) /*!< 0x00000100 */
#define DBGMCU1_APB1_FZ_DBG_TIM14_STOP                DBGMCU1_APB1_FZ_DBG_TIM14_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_RTC_STOP_Pos              (10U)
#define DBGMCU1_APB1_FZ_DBG_RTC_STOP_Msk              (0x1U << DBGMCU1_APB1_FZ_DBG_RTC_STOP_Pos) /*!< 0x00000400 */
#define DBGMCU1_APB1_FZ_DBG_RTC_STOP                  DBGMCU1_APB1_FZ_DBG_RTC_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_WWDG_STOP_Pos             (11U)
#define DBGMCU1_APB1_FZ_DBG_WWDG_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_WWDG_STOP_Pos) /*!< 0x00000800 */
#define DBGMCU1_APB1_FZ_DBG_WWDG_STOP                 DBGMCU1_APB1_FZ_DBG_WWDG_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_IWDG_STOP_Pos             (12U)
#define DBGMCU1_APB1_FZ_DBG_IWDG_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_IWDG_STOP_Pos) /*!< 0x00001000 */
#define DBGMCU1_APB1_FZ_DBG_IWDG_STOP                 DBGMCU1_APB1_FZ_DBG_IWDG_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT_Pos    (21U)
#define DBGMCU1_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT_Msk    (0x1U << DBGMCU1_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT_Pos) /*!< 0x00200000 */
#define DBGMCU1_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT        DBGMCU1_APB1_FZ_DBG_I2C1_SMBUS_TIMEOUT_Msk
#define DBGMCU1_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT_Pos    (22U)
#define DBGMCU1_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT_Msk    (0x1U << DBGMCU1_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT_Pos) /*!< 0x00400000 */
#define DBGMCU1_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT        DBGMCU1_APB1_FZ_DBG_I2C2_SMBUS_TIMEOUT_Msk
#define DBGMCU1_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT_Pos    (23U)
#define DBGMCU1_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT_Msk    (0x1U << DBGMCU1_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT_Pos) /*!< 0x00800000 */
#define DBGMCU1_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT        DBGMCU1_APB1_FZ_DBG_I2C3_SMBUS_TIMEOUT_Msk
#define DBGMCU1_APB1_FZ_DBG_CAN1_STOP_Pos             (25U)
#define DBGMCU1_APB1_FZ_DBG_CAN1_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_CAN1_STOP_Pos) /*!< 0x02000000 */
#define DBGMCU1_APB1_FZ_DBG_CAN1_STOP                 DBGMCU1_APB1_FZ_DBG_CAN1_STOP_Msk
#define DBGMCU1_APB1_FZ_DBG_CAN2_STOP_Pos             (26U)
#define DBGMCU1_APB1_FZ_DBG_CAN2_STOP_Msk             (0x1U << DBGMCU1_APB1_FZ_DBG_CAN2_STOP_Pos) /*!< 0x04000000 */
#define DBGMCU1_APB1_FZ_DBG_CAN2_STOP                 DBGMCU1_APB1_FZ_DBG_CAN2_STOP_Msk
/* Old IWDGSTOP bit definition, maintained for legacy purpose */
#define  DBGMCU1_APB1_FZ_DBG_IWDEG_STOP           DBGMCU1_APB1_FZ_DBG_IWDG_STOP

/********************  Bit definition for DBGMCU1_APB2_FZ register  ************/
#define DBGMCU1_APB2_FZ_DBG_TIM1_STOP_Pos             (0U)
#define DBGMCU1_APB2_FZ_DBG_TIM1_STOP_Msk             (0x1U << DBGMCU1_APB2_FZ_DBG_TIM1_STOP_Pos) /*!< 0x00000001 */
#define DBGMCU1_APB2_FZ_DBG_TIM1_STOP                 DBGMCU1_APB2_FZ_DBG_TIM1_STOP_Msk
#define DBGMCU1_APB2_FZ_DBG_TIM8_STOP_Pos             (1U)
#define DBGMCU1_APB2_FZ_DBG_TIM8_STOP_Msk             (0x1U << DBGMCU1_APB2_FZ_DBG_TIM8_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU1_APB2_FZ_DBG_TIM8_STOP                 DBGMCU1_APB2_FZ_DBG_TIM8_STOP_Msk
#define DBGMCU1_APB2_FZ_DBG_TIM9_STOP_Pos             (16U)
#define DBGMCU1_APB2_FZ_DBG_TIM9_STOP_Msk             (0x1U << DBGMCU1_APB2_FZ_DBG_TIM9_STOP_Pos) /*!< 0x00010000 */
#define DBGMCU1_APB2_FZ_DBG_TIM9_STOP                 DBGMCU1_APB2_FZ_DBG_TIM9_STOP_Msk
#define DBGMCU1_APB2_FZ_DBG_TIM10_STOP_Pos            (17U)
#define DBGMCU1_APB2_FZ_DBG_TIM10_STOP_Msk            (0x1U << DBGMCU1_APB2_FZ_DBG_TIM10_STOP_Pos) /*!< 0x00020000 */
#define DBGMCU1_APB2_FZ_DBG_TIM10_STOP                DBGMCU1_APB2_FZ_DBG_TIM10_STOP_Msk
#define DBGMCU1_APB2_FZ_DBG_TIM11_STOP_Pos            (18U)
#define DBGMCU1_APB2_FZ_DBG_TIM11_STOP_Msk            (0x1U << DBGMCU1_APB2_FZ_DBG_TIM11_STOP_Pos) /*!< 0x00040000 */
#define DBGMCU1_APB2_FZ_DBG_TIM11_STOP                DBGMCU1_APB2_FZ_DBG_TIM11_STOP_Msk
//}}}
//{{{  DBGMCU         0xE0042000
#define DBGMCU1_BASE        0xE0042000U
#define DBGMCU1              ((DBGMCU1_TypeDef *) DBGMCU_BASE)
typedef struct {
  __IO uint32_t IDCODE;  /*!< MCU device ID code,               Address offset: 0x00 */
  __IO uint32_t CR;      /*!< Debug MCU configuration register, Address offset: 0x04 */
  __IO uint32_t APB1FZ;  /*!< Debug MCU APB1 freeze register,   Address offset: 0x08 */
  __IO uint32_t APB2FZ;  /*!< Debug MCU APB2 freeze register,   Address offset: 0x0C */
  }DBGMCU1_TypeDef;
//}}}
//}}}

