colinporth/stm32F429disco/Src/main.cpp
  // PLLSAI_VCO Input  = HSE_VALUE / PLL_M = 1mhz
  // PLLSAI_VCO Output = PLLSAI_VCO Input * PLLSAIN     = 130mhz
  // PLLLCDCLK         = PLLSAI_VCO Output / PLLSAIR    = 130/2 = 65mhz
  // LTDC clock        = PLLLCDCLK / LTDC_PLLSAI_DIVR_2 = 65/2  = 32.5mhz
  RCC_PeriphCLKInitTypeDef rccPeriphClkInit;
  rccPeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_LTDC;
  rccPeriphClkInit.PLLSAI.PLLSAIN = 130;  // hclk = 192mhz, 138/4 = 34.5mhz
  rccPeriphClkInit.PLLSAI.PLLSAIR = 2;
  rccPeriphClkInit.PLLSAIDivR = RCC_PLLSAIDIVR_2;
  HAL_RCCEx_PeriphCLKConfig (&rccPeriphClkInit);

  //rccPeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SDIO | RCC_PERIPHCLK_CK48;
  //rccPeriphClkInit.SdioClockSelection = RCC_SDIOCLKSOURCE_CK48;
  //rccPeriphClkInit.Clk48ClockSelection = RCC_CK48CLKSOURCE_PLLSAIP;
  //rccPeriphClkInit.PLLSAI.PLLSAIN = 384;
  //rccPeriphClkInit.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV8;
  //HAL_RCCEx_PeriphCLKConfig (&rccPeriphClkInit);

  // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  HAL_RCC_ClockConfig (&RCC_ClkInitStruct, FLASH_LATENCY_5);
  }
//}}}
//{{{
void memoryTest() {

  uint32_t readAddress = SDRAM_BANK1_ADDR;
  uint32_t phase = 0;
  while (1) {
    uint32_t len = (readAddress == SDRAM_BANK1_ADDR) ? SDRAM_BANK1_LEN : SDRAM_BANK2_LEN;
    uint32_t reportMask = 0xFFFFF;

    //  write
    for (uint32_t i = readAddress; i < readAddress + len; i++)
      *(uint8_t*)readAddress = (i+phase) & 0xFF;

    // read
    uint8_t readErr = 0;
    for (uint32_t i = readAddress; i < readAddress + len; i++) {
      uint8_t read = *(uint8_t*)readAddress;
      if (read != ((i+phase) & 0xFF)) {
        readErr++;
        //printf ("add:%x exp:%x got:%x\n", i, (i+phase) & 0xFF, read);
        }

      if ((i & reportMask) == reportMask) {
        if (readErr)
          printf ("add:%x err:%x rate:%d\n", (unsigned int)i, (unsigned int)readErr, (int)((readErr * 100) / reportMask));
        else
          printf ("add:%lx ok\n", i);

        if (readErr) { // red
          //BSP_LED_Off (LED3);
          //BSP_LED_On (LED4);
          readErr = 0;
          }
        else { // green
          //BSP_LED_Off (LED4);
          //BSP_LED_On (LED3);
          }
        }
      }

    phase++;
    readAddress = (readAddress == SDRAM_BANK1_ADDR) ? SDRAM_BANK2_ADDR : SDRAM_BANK1_ADDR;
    }
  }
//}}}
//}}}

//{{{  lcd
//{{{  colour defines
#define COL_WHITE         0xFFFF
//#define COL_LIGHTGREY     0xFFD3D3D3
//#define COL_GREY          0xFF808080
//#define COL_DARKGREY      0xFF404040
//#define COL_DARKERGREY    0xFF202020
#define COL_BLACK         0x0000

#define COL_BLUE          0x001F
//#define COL_LIGHTBLUE     0xFF8080FF
//#define COL_DARKBLUE      0xFF000080

#define COL_GREEN         0x07E0
//#define COL_LIGHTGREEN    0xFF80FF80
//#define COL_DARKGREEN     0xFF008000
//#define COL_DARKERGREEN   0xFF004000

#define COL_RED           0xF800
//#define COL_LIGHTRED      0xFFFF8080
//#define COL_DARKRED       0xFF800000

#define COL_CYAN          0x07FF
//#define COL_LIGHTCYAN     0xFF80FFFF
//#define COL_DARKCYAN      0xFF008080

#define COL_MAGENTA       0xF81F
//#define COL_LIGHTMAGENTA  0xFFFF80FF
//#define COL_DARKMAGENTA   0xFF800080

#define COL_YELLOW        0xFFE0
//#define COL_LIGHTYELLOW   0xFFFFFF80
//#define COL_DARKYELLOW    0xFF808000
//#define COL_DARKERYELLOW  0xFF202000

//#define COL_BROWN         0xFFA52A2A
//#define COL_ORANGE        0xFFFFA500
//#define COL_DARKORANGE    0xFFC07800
//#define COL_DARKERORANGE  0xFF805000
//}}}
//{{{  lcd vars
const int kEnd = 0;
const int kStamp = 1;

#define DMA2D_BUFFER         0x10000000
#define DMA2D_BUFFER_SIZE        0x9000  // SIZE = rest of dtcm

class cLcd;
cLcd* lcd = nullptr;

//{{{  struct tLTDC
typedef struct {
  //SemaphoreHandle_t sem;
  uint32_t timeouts;
  uint32_t lineIrq;
  uint32_t fifoUnderunIrq;
  uint32_t transferErrorIrq;
  uint32_t lastTicks;
  uint32_t lineTicks;
  uint32_t frameWait;
  } tLTDC;
//}}}
tLTDC ltdc;

uint8_t showAlpha[2];
uint32_t showFrameBufferAddress[2];

uint32_t* mDma2dBuf = nullptr;
uint32_t* mDma2dIsrBuf = nullptr;
//}}}

uint16_t getFontHeight() { return 26; }
uint16_t getBigFontHeight() { return 40; }
uint16_t getSmallFontHeight() { return 12; }
uint16_t getBoxHeight() { return 30; }
//{{{
void LCD_DMA2D_IRQHandler() {

  // clear interrupts
  DMA2D->IFCR = DMA2D_ISR_TCIF | DMA2D_ISR_TEIF | DMA2D_ISR_CEIF;

  while (true) {
    uint32_t opcode = *mDma2dIsrBuf++;
    switch (opcode) {
      case kEnd: {
        DMA2D->CR = 0;
        mDma2dIsrBuf = mDma2dBuf;
        return;
        }

      case kStamp:
        DMA2D->OMAR    = *mDma2dIsrBuf;   // output start address
        DMA2D->BGMAR   = *mDma2dIsrBuf++; // - repeated to bgnd start addres
        DMA2D->OOR     = *mDma2dIsrBuf;   // output stride
        DMA2D->BGOR    = *mDma2dIsrBuf++; // - repeated to bgnd stride
        DMA2D->NLR     = *mDma2dIsrBuf++; // width:height
        DMA2D->FGMAR   = *mDma2dIsrBuf++; // fgnd start address
        DMA2D->FGPFCCR = DMA2D_INPUT_A8;  // fgnd PFC
        DMA2D->FGOR    = 0;               // fgnd stride
        DMA2D->CR = DMA2D_M2M_BLEND | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
        while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
        DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                       DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
        break;

      default: // opcode==address : value
        *(uint32_t*)opcode = *mDma2dIsrBuf++;
        if (opcode == (uint32_t)DMA2D) { // address of CR
          while (!(DMA2D->ISR & DMA2D_FLAG_TC)) {}
          DMA2D->IFCR |= DMA2D_IFSR_CTEIF | DMA2D_IFSR_CTCIF | DMA2D_IFSR_CTWIF|
                         DMA2D_IFSR_CCAEIF | DMA2D_IFSR_CCTCIF | DMA2D_IFSR_CCEIF;
         break;
         }
      }
    }
  }
//}}}

class cLcd {
public:
  //{{{
  cLcd (uint32_t buffer0, uint32_t buffer1)  {

    mBuffer[false] = buffer0;
    mBuffer[true] = buffer1;
    updateNumDrawLines();
    }
  //}}}
  ~cLcd() {}
  //{{{
  void init (std::string title) {

    mDrawBuffer = !mDrawBuffer;
    ltdcInit (mBuffer[mDrawBuffer]);

    // init unchanging dma2d regs
    DMA2D->OPFCCR  = DMA2D_INPUT_RGB565;
    DMA2D->BGPFCCR = DMA2D_INPUT_RGB565;

