colinporth/stm32F429disco/Src/main.cpp
    // zero out first opcode, point past it
    mDma2dBuf = (uint32_t*)DMA2D_BUFFER;
    mDma2dIsrBuf = mDma2dBuf;
    mDma2dCurBuf = mDma2dBuf;
    *mDma2dCurBuf = kEnd;

    // dma2d IRQ init
    //HAL_NVIC_SetPriority (DMA2D_IRQn, 0x0F, 0);
    //HAL_NVIC_EnableIRQ (DMA2D_IRQn);

    // font init
    FT_Init_FreeType (&FTlibrary);
    FT_New_Memory_Face (FTlibrary, (FT_Byte*)freeSansBold, sizeof (freeSansBold), 0, &FTface);
    FTglyphSlot = FTface->glyph;

    // preload fontChars
    for (char ch = 0x20; ch <= 0x7F; ch++)
      loadChar (getFontHeight(), ch);
    //for (char ch = 0x21; ch <= 0x3F; ch++)
    //  loadChar (getBigFontHeight(), ch);
    //for (char ch = 0x21; ch <= 0x3F; ch++)
    //  loadChar (getSmallFontHeight(), ch);

    FT_Done_Face (FTface);
    //FT_Done_FreeType (FTlibrary);

    mTitle = title;
    updateNumDrawLines();
    }
  //}}}

  uint16_t getLcdWidthPix() { return 800; }
  uint16_t getLcdHeightPix() { return 1280; }

  //{{{
  void setShowDebug (bool title, bool info, bool lcdStats, bool footer) {

    mShowTitle = title;
    mShowInfo = info;
    mShowLcdStats = lcdStats;
    mShowFooter = footer;

    updateNumDrawLines();
    }
  //}}}
  //{{{
  void debug (std::string str) {
    info (COL_WHITE, str);
    render();
    }
  //}}}
  //{{{
  void info (std::string str) {
    info (COL_WHITE, str);
    }
  //}}}
  //{{{
  void info (uint16_t colour, std::string str) {

    bool tailing = mLastLine == (int)mFirstLine + mNumDrawLines - 1;

    auto line = (mLastLine < mMaxLine-1) ? mLastLine+1 : mLastLine;
    mLines[line].mTime = HAL_GetTick(); //xTaskGetTickCount();
    mLines[line].mColour = colour;
    mLines[line].mString = str;
    mLastLine = line;

    if (tailing)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    }
  //}}}

  //{{{
  void press (int pressCount, int16_t x, int16_t y, uint16_t z, int16_t xinc, int16_t yinc) {

    if ((pressCount > 30) && (x <= mStringPos) && (y <= getBoxHeight()))
      reset();
    else if (pressCount == 0) {
      if (x <= mStringPos) {
        // set displayFirstLine
        if (y < 2 * getBoxHeight())
          displayTop();
        else if (y > getLcdHeightPix() - 2 * getBoxHeight())
          displayTail();
        }
      }
    else {
      // inc firstLine
      float value = mFirstLine - ((2.0f * yinc) / getBoxHeight());

      if (value < 0)
        mFirstLine = 0;
      else if (mLastLine <= (int)mNumDrawLines-1)
        mFirstLine = 0;
      else if (value > mLastLine - mNumDrawLines + 1)
        mFirstLine = mLastLine - mNumDrawLines + 1;
      else
        mFirstLine = value;
      }
    }
  //}}}
  //{{{
  void startRender() {

    mDrawBuffer = !mDrawBuffer;
    setLayer (0, mBuffer[mDrawBuffer]);

    // frameSync;
    //ltdc.frameWait = 1;
    //if (xSemaphoreTake (ltdc.sem, 100) == pdFALSE)
    //  ltdc.timeouts++;

    mDrawStartTime = HAL_GetTick();
    }
  //}}}
  //{{{
  void renderCursor (uint16_t colour, int16_t x, int16_t y, int16_t z) {
    ellipse (colour, x, y, z, z);
    }
  //}}}
  //{{{
  void endRender (bool forceInfo) {

    auto y = 0;
    if ((mShowTitle || forceInfo) && !mTitle.empty()) {
      //{{{  draw title
      text (COL_YELLOW, getFontHeight(), mTitle, 0, y, getLcdWidthPix(), getBoxHeight());
      y += getBoxHeight();
      }
      //}}}
    if (mShowInfo || forceInfo) {
      //{{{  draw info lines
      if (mLastLine >= 0) {
        // draw scroll bar
        auto yorg = getBoxHeight() + ((int)mFirstLine * mNumDrawLines * getBoxHeight() / (mLastLine + 1));
        auto height = mNumDrawLines * mNumDrawLines * getBoxHeight() / (mLastLine + 1);
        rectClipped (COL_YELLOW, 0, yorg, 8, height);
        }

      auto lastLine = (int)mFirstLine + mNumDrawLines - 1;
      if (lastLine > mLastLine)
        lastLine = mLastLine;

      for (auto lineIndex = (int)mFirstLine; lineIndex <= lastLine; lineIndex++) {
        auto x = 0;
        auto xinc = text (COL_GREEN, getFontHeight(),
                          dec ((mLines[lineIndex].mTime-mStartTime) / 1000) + "." +
                          dec ((mLines[lineIndex].mTime-mStartTime) % 1000, 3, '0'),
                          x, y, getLcdWidthPix(), getBoxHeight());
        x += xinc + 3;

        text (mLines[lineIndex].mColour, getFontHeight(), mLines[lineIndex].mString,
              x, y, getLcdWidthPix()-x, getLcdHeightPix());

        y += getBoxHeight();
        }
      }
      //}}}
    if (mShowLcdStats) {
      //{{{  draw lcdStats
      std::string str = dec (ltdc.lineIrq) + ":f " +
                        dec (ltdc.lineTicks) + "ms " +
                        dec (mDma2dTimeouts) + " " +
                        dec (ltdc.transferErrorIrq) + " " +
                        dec (ltdc.fifoUnderunIrq);
      text (COL_WHITE, getFontHeight(), str, 0, getLcdHeightPix() - 2 * getBoxHeight(), getLcdWidthPix(), 24);
      }
      //}}}
    if (mShowFooter || forceInfo)
      //{{{  draw footer
      text (COL_WHITE, getFontHeight(),
            //dec (xPortGetFreeHeapSize()) + " " +
            //dec (xPortGetMinimumEverFreeHeapSize()) + " " +
            //dec (osGetCPUUsage()) + "% " +
          dec (mDrawTime) + "ms " + dec (mDma2dCurBuf - mDma2dBuf),
            0, -getFontHeight() + getLcdHeightPix(), getLcdWidthPix(), getFontHeight());
      //}}}

    // terminate opCode buffer
    *mDma2dCurBuf = kEnd;

    // send opCode buffer
    LCD_DMA2D_IRQHandler();
    showLayer (0, mBuffer[mDrawBuffer], 255);

    // reset opcode buffer
    mDma2dCurBuf = mDma2dBuf;
    *mDma2dCurBuf = kEnd;

    mDrawTime = HAL_GetTick() - mDrawStartTime;
    }
  //}}}

  //{{{
  void render() {
    startRender();
    clear (COL_BLACK);
    endRender (true);
    }
  //}}}
  //{{{
  void displayOn() {
    GPIOD->BSRR = GPIO_PIN_13;   // ADJ hi
    }
  //}}}
  //{{{
  void displayOff() {
    GPIOD->BSRR = GPIO_PIN_13 << 16;   // ADJ lo
    }
  //}}}

  //{{{
  void pixel (uint16_t colour, int16_t x, int16_t y) {

    rect (colour, x, y, 1, 1);
    }
  //}}}
  //{{{
  void rect (uint16_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    // often same colour
    if (colour != mCurDstColour) {
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OCOLR); // OCOLR - output colour
      *mDma2dCurBuf++ = colour;
      mCurDstColour = colour;
      }

    // quite often same stride
    if (uint32_t(getLcdWidthPix() - width) != mDstStride) {
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OOR); // OOR - output stride
      mDstStride = getLcdWidthPix() - width;
      *mDma2dCurBuf++ = mDstStride;
      }

    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->OMAR); // OMAR - output start address 3c
    *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents;

