colinporth/stm32F429disco/Src/main.cpp
    *mDma2dCurBuf++ = (uint32_t)&(DMA2D->NLR);
    *mDma2dCurBuf++ = (width << 16) | height;

    *mDma2dCurBuf++ = (uint32_t)DMA2D; // CR
    *mDma2dCurBuf++ = DMA2D_R2M | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    }
  //}}}
  //{{{
  void stamp (uint16_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    // often same colour
    if (colour != mCurSrcColour) {
      uint32_t fullColour = ((colour & 0xF800) << 8) | ((colour & 0x07E0) << 5) | ((colour & 0x001F) << 3);
      *mDma2dCurBuf++ = (uint32_t)&(DMA2D->FGCOLR); // FGCOLR - fgnd colour
      *mDma2dCurBuf++ = fullColour;
      mCurSrcColour = colour;
      }

    *mDma2dCurBuf++ = kStamp;
    *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents; // output start address
    mDstStride = getLcdWidthPix() - width;
    *mDma2dCurBuf++ = mDstStride;                                          // stride
    *mDma2dCurBuf++ = (width << 16) | height;                              // width:height
    *mDma2dCurBuf++ = (uint32_t)src;                                       // fgnd start address
    }
  //}}}
  //{{{
  int text (uint16_t colour, uint16_t fontHeight, std::string str, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    auto xend = x + width;
    for (uint16_t i = 0; i < str.size(); i++) {
      if ((str[i] >= 0x20) && (str[i] <= 0x7F)) {
        auto fontCharIt = mFontCharMap.find (fontHeight<<8 | str[i]);
        if (fontCharIt != mFontCharMap.end()) {
          auto fontChar = fontCharIt->second;
          if (x + fontChar->left + fontChar->pitch >= xend)
            break;
          else if (fontChar->bitmap)
            stampClipped (colour, fontChar->bitmap, x + fontChar->left, y + fontHeight - fontChar->top, fontChar->pitch, fontChar->rows);

          x += fontChar->advance;
          }
        }
      }

    return x;
    }
  //}}}
  //{{{
  void copy (uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {
  // copy

    // output
    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x3C; // OMAR - output start address
    *mDma2dCurBuf++ = mCurFrameBufferAddress + ((y * getLcdWidthPix()) + x) * dstComponents;

    mDstStride = getLcdWidthPix() - width;
    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x40; // OOR - output stride
    *mDma2dCurBuf++ = mDstStride;

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x44; // NLR - width:height
    *mDma2dCurBuf++ = (width << 16) | height;

    // src - fgnd
    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x1C; // FGPFCCR - fgnd PFC
    *mDma2dCurBuf++ = DMA2D_INPUT_RGB565;

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x0C; // FGMAR - fgnd address
    *mDma2dCurBuf++ = (uint32_t)src;

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x10; // FGOR - fgnd stride
    *mDma2dCurBuf++ = 0;

    *mDma2dCurBuf++ = (uint32_t)DMA2D;        // CR
    *mDma2dCurBuf++ = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    }
  //}}}
  //{{{
  void copy (uint8_t* src, int16_t srcx, int16_t srcy, uint16_t srcWidth, uint16_t srcHeight,
                   int16_t dstx, int16_t dsty, uint16_t dstWidth, uint16_t dstHeight) {
  // copy src to dst
  // - some corner cases missing, not enough src for dst needs padding

    // output
    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x3C; // OMAR - output start address
    *mDma2dCurBuf++ = mCurFrameBufferAddress + ((dsty * getLcdWidthPix()) + dstx) * dstComponents;

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x40; // OOR - output stride
    mDstStride = getLcdWidthPix() - dstWidth;
    *mDma2dCurBuf++ = mDstStride;

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x44; // NLR - width:height
    *mDma2dCurBuf++ = (dstWidth << 16) | dstHeight;

    // src - fgnd
    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x1C; // FGPFCCR - fgnd PFC
    *mDma2dCurBuf++ = DMA2D_INPUT_RGB888;

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x0C; // FGMAR - fgnd address
    *mDma2dCurBuf++ = (uint32_t)(src + ((srcy * srcWidth) + srcx) * dstComponents);

    *mDma2dCurBuf++ = (uint32_t)DMA2D + 0x10; // FGOR - fgnd stride
    *mDma2dCurBuf++ = srcWidth - dstWidth;

    // CR
    *mDma2dCurBuf++ = (uint32_t)DMA2D;        // CR
    *mDma2dCurBuf++ = DMA2D_M2M_PFC | DMA2D_CR_TCIE | DMA2D_CR_TEIE | DMA2D_CR_CEIE | DMA2D_CR_START;
    }
  //}}}

  //{{{
  void pixelClipped (uint16_t colour, int16_t x, int16_t y) {

      rectClipped (colour, x, y, 1, 1);
    }
  //}}}
  //{{{
  void stampClipped (uint16_t colour, uint8_t* src, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    if (!width || !height || x < 0)
      return;

    if (y < 0) {
      // top clip
      if (y + height <= 0)
        return;
      height += y;
      src += -y * width;
      y = 0;
      }

    if (y + height > getLcdHeightPix()) {
      // bottom yclip
      if (y >= getLcdHeightPix())
        return;
      height = getLcdHeightPix() - y;
      }

    stamp (colour, src, x, y, width, height);
    }
  //}}}
  //{{{
  void rectClipped (uint16_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height) {

    if (x >= getLcdWidthPix())
      return;
    if (y >= getLcdHeightPix())
      return;

    int xend = x + width;
    if (xend <= 0)
      return;

    int yend = y + height;
    if (yend <= 0)
      return;

    if (x < 0)
      x = 0;
    if (xend > getLcdWidthPix())
      xend = getLcdWidthPix();

    if (y < 0)
      y = 0;
    if (yend > getLcdHeightPix())
      yend = getLcdHeightPix();

    if (!width)
      return;
    if (!height)
      return;

    rect (colour, x, y, xend - x, yend - y);
    }
  //}}}
  //{{{
  void rectOutline (uint16_t colour, int16_t x, int16_t y, uint16_t width, uint16_t height, uint8_t thickness) {

    rectClipped (colour, x, y, width, thickness);
    rectClipped (colour, x + width-thickness, y, thickness, height);
    rectClipped (colour, x, y + height-thickness, width, thickness);
    rectClipped (colour, x, y, thickness, height);
    }
  //}}}
  //{{{
  void clear (uint16_t colour) {

    rect (colour, 0, 0, getLcdWidthPix(), getLcdHeightPix());
    }
  //}}}
  //{{{
  void ellipse (uint16_t colour, int16_t x, int16_t y, uint16_t xradius, uint16_t yradius) {

    if (!xradius)
      return;
    if (!yradius)
      return;

    int x1 = 0;
    int y1 = -yradius;
    int err = 2 - 2*xradius;
    float k = (float)yradius / xradius;

    do {
      rectClipped (colour, (x-(uint16_t)(x1 / k)), y + y1, (2*(uint16_t)(x1 / k) + 1), 1);
      rectClipped (colour, (x-(uint16_t)(x1 / k)), y - y1, (2*(uint16_t)(x1 / k) + 1), 1);

