colinporth/stm32F429disco/Src/main.cpp
    #define LCD_WIDTH   800  // min 39Mhz typ 45Mhz max 51.42Mhz
    #define LCD_HEIGHT 1280
    #define HORIZ_SYNC   64  // min  136  typ 176   max 216
    #define VERT_SYNC     1  // min   12  typ  25   max  38

    LtdcHandler.Instance = LTDC;
    LtdcHandler.Init.HorizontalSync     = HORIZ_SYNC - 1;
    LtdcHandler.Init.AccumulatedHBP     = HORIZ_SYNC - 1;
    LtdcHandler.Init.AccumulatedActiveW = HORIZ_SYNC + LCD_WIDTH - 1;
    LtdcHandler.Init.TotalWidth         = HORIZ_SYNC + LCD_WIDTH - 1;
    LtdcHandler.Init.VerticalSync       = VERT_SYNC - 1;
    LtdcHandler.Init.AccumulatedVBP     = VERT_SYNC - 1;
    LtdcHandler.Init.AccumulatedActiveH = VERT_SYNC + LCD_HEIGHT - 1;
    LtdcHandler.Init.TotalHeigh         = VERT_SYNC + LCD_HEIGHT - 1;
    LtdcHandler.Init.HSPolarity = LTDC_HSPOLARITY_AL;
    LtdcHandler.Init.VSPolarity = LTDC_VSPOLARITY_AL;
    LtdcHandler.Init.DEPolarity = LTDC_DEPOLARITY_AL;
    LtdcHandler.Init.PCPolarity = LTDC_PCPOLARITY_IPC;
    LtdcHandler.Init.Backcolor.Red = 0;
    LtdcHandler.Init.Backcolor.Blue = 0;
    LtdcHandler.Init.Backcolor.Green = 0;
    HAL_LTDC_Init (&LtdcHandler);

    //DMA2D->AMTCR = 0x3F01;

    layerInit (0, frameBufferAddress);
    mSetFrameBufferAddress[1] = frameBufferAddress;
    showFrameBufferAddress[1] = frameBufferAddress;
    showAlpha[1] = 0;

    ltdc.timeouts = 0;
    ltdc.lineIrq = 0;
    ltdc.fifoUnderunIrq = 0;
    ltdc.transferErrorIrq = 0;
    ltdc.lastTicks = 0;
    ltdc.lineTicks = 0;
    ltdc.frameWait = 0;

    //vSemaphoreCreateBinary (ltdc.sem);

   // HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
   // HAL_NVIC_EnableIRQ (LTDC_IRQn);

    // set line interupt line number
    //LTDC->LIPCR = 0;

    // enable line interrupt
    //LTDC->IER |= LTDC_IT_LI;
    }
  //}}}
  //{{{
  void layerInit (uint8_t layer, uint32_t frameBufferAddress) {

    LTDC_LayerCfgTypeDef* curLayerCfg = &LtdcHandler.LayerCfg[layer];

    curLayerCfg->WindowX0 = 0;
    curLayerCfg->WindowX1 = getLcdWidthPix();
    curLayerCfg->WindowY0 = 0;
    curLayerCfg->WindowY1 = getLcdHeightPix();

    curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_RGB565;

    curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

    curLayerCfg->Alpha = 255;
    curLayerCfg->Alpha0 = 0;

    curLayerCfg->Backcolor.Blue = 0;
    curLayerCfg->Backcolor.Green = 0;
    curLayerCfg->Backcolor.Red = 0;

    curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
    curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

    curLayerCfg->ImageWidth = getLcdWidthPix();
    curLayerCfg->ImageHeight = getLcdHeightPix();

    HAL_LTDC_ConfigLayer (&LtdcHandler, curLayerCfg, layer);

    // local state
    mCurFrameBufferAddress = frameBufferAddress;
    mSetFrameBufferAddress[layer] = frameBufferAddress;
    showFrameBufferAddress[layer] = frameBufferAddress;
    showAlpha[layer] = 255;
    }
  //}}}
  //{{{
  void setLayer (uint8_t layer, uint32_t frameBufferAddress) {

    mCurFrameBufferAddress = frameBufferAddress;
    mSetFrameBufferAddress[layer] = frameBufferAddress;
    }
  //}}}
  //{{{
  void showLayer (uint8_t layer, uint32_t frameBufferAddress, uint8_t alpha) {

    showFrameBufferAddress[layer] = frameBufferAddress;
    showAlpha[layer] = alpha;

    LTDC_Layer_TypeDef* ltdcLayer = (LTDC_Layer_TypeDef*)((uint32_t)LTDC + 0x84); // + (0x80*layer));
    ltdcLayer->CFBAR = showFrameBufferAddress[0];
    if (showAlpha[0]) {
      ltdcLayer->CR |= LTDC_LxCR_LEN;
      ltdcLayer->CACR &= ~LTDC_LxCACR_CONSTA;
      ltdcLayer->CACR = showAlpha[0];
      }
    else
      ltdcLayer->CR &= ~LTDC_LxCR_LEN;
    LTDC->SRCR |= LTDC_SRCR_IMR;
    }
  //}}}

  //{{{
  cFontChar* loadChar (uint16_t fontHeight, char ch) {

    FT_Set_Pixel_Sizes (FTface, 0, fontHeight);
    FT_Load_Char (FTface, ch, FT_LOAD_RENDER);

    auto fontChar = new cFontChar();
    fontChar->left = FTglyphSlot->bitmap_left;
    fontChar->top = FTglyphSlot->bitmap_top;
    fontChar->pitch = FTglyphSlot->bitmap.pitch;
    fontChar->rows = FTglyphSlot->bitmap.rows;
    fontChar->advance = FTglyphSlot->advance.x / 64;
    fontChar->bitmap = nullptr;

    if (FTglyphSlot->bitmap.buffer) {
      fontChar->bitmap = (uint8_t*)malloc (FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
      memcpy (fontChar->bitmap, FTglyphSlot->bitmap.buffer, FTglyphSlot->bitmap.pitch * FTglyphSlot->bitmap.rows);
      }

    auto insertPair = mFontCharMap.insert (cFontCharMap::value_type (fontHeight<<8 | ch, fontChar));
    auto fontCharIt = insertPair.first;

    return fontCharIt->second;
    }
  //}}}
  //{{{
  void reset() {

    for (auto i = 0; i < mMaxLine; i++)
      mLines[i].clear();

    mStartTime = HAL_GetTick();
    mLastLine = -1;
    mFirstLine = 0;
    }
  //}}}
  //{{{
  void displayTop() {
    mFirstLine = 0;
    }
  //}}}
  //{{{
  void displayTail() {

    if (mLastLine > (int)mNumDrawLines-1)
      mFirstLine = mLastLine - mNumDrawLines + 1;
    else
      mFirstLine = 0;
    }
  //}}}
  //{{{
  void updateNumDrawLines() {

    mStringPos = getBoxHeight()*3;

    auto numDrawLines = getLcdHeightPix() / getBoxHeight();
    if (mShowTitle && !mTitle.empty())
      numDrawLines--;
    if (mShowLcdStats)
      numDrawLines--;
    if (mShowFooter)
      numDrawLines--;

    mNumDrawLines = numDrawLines;
    }
  //}}}

  //{{{  vars
  LTDC_HandleTypeDef LtdcHandler;

  int mStartTime = 0;

  float mFirstLine = 0;
  int mNumDrawLines = 0;
  int mStringPos = 0;

  bool mShowTitle = true;
  bool mShowInfo = true;
  bool mShowLcdStats = false;
  bool mShowFooter = true;

  std::string mTitle;

  int mLastLine = -1;
  int mMaxLine = 256;

  //{{{
  class cLine {
  public:
    cLine() {}
    ~cLine() {}

    //{{{
    void clear() {
      mTime = 0;
      mColour = COL_WHITE;
      mString = "";
      }
    //}}}

    int mTime = 0;
    int mColour = COL_WHITE;
    std::string mString;
    };
  //}}}
  cLine mLines[256];

  int mDrawStartTime = 0;
  int mDrawTime = 0;
  bool mDrawBuffer = false;
  uint32_t mBuffer[2] = {0,0};

  uint32_t* mDma2dCurBuf = nullptr;
  uint32_t mDma2dTimeouts = 0;

  uint32_t mCurFrameBufferAddress = 0;
  uint32_t mSetFrameBufferAddress[2];
  uint32_t mCurDstColour = 0;
  uint32_t mCurSrcColour = 0;
  uint32_t mDstStride = 0;

  cFontCharMap mFontCharMap;

  FT_Library FTlibrary;
  FT_Face FTface;
  FT_GlyphSlot FTglyphSlot;
  //}}}
  };
//}}}

//{{{  ps2 keyboard defines
#define PS2_TAB       9
#define PS2_ENTER     13
#define PS2_BACKSPACE     127
#define PS2_ESC       27
#define PS2_INSERT      0
#define PS2_DELETE      127
#define PS2_HOME      0
#define PS2_END       0
#define PS2_PAGEUP      25
#define PS2_PAGEDOWN      26
#define PS2_UPARROW     11
#define PS2_LEFTARROW     8
#define PS2_DOWNARROW     10
#define PS2_RIGHTARROW      21

#define PS2_F1        0
#define PS2_F2        0
#define PS2_F3        0
#define PS2_F4        0
#define PS2_F5        0
#define PS2_F6        0
#define PS2_F7        0
#define PS2_F8        0
#define PS2_F9        0
#define PS2_F10       0
#define PS2_F11       0
#define PS2_F12       0
#define PS2_SCROLL      0

