colinporth/stm32F429disco/Src/main.cpp
//{{{
uint16_t ps2get() {
  while (inPtr == outPtr) {}
  uint16_t ch = rxData[outPtr];
  outPtr = (outPtr + 1) % 32;
  return ch;
  }
//}}}
//{{{
void ps2send (uint8_t value)  {

  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_2, GPIO_PIN_RESET); // set clock lo, release inhibit, if necessary
  HAL_Delay (2); // Wait out any final clock pulse, 100us

  ps2rx = false;
  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_3, GPIO_PIN_RESET); // set data lo, start bit
  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_2, GPIO_PIN_SET);   // set clock hi, float

  uint8_t parity = 1;
  for (int bit = 0; bit < 8; bit++) {
    while (HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for rising edge
    HAL_GPIO_WritePin (GPIOG, GPIO_PIN_3, (value & 0x01) ? GPIO_PIN_SET : GPIO_PIN_RESET); // set data to i’th data bit
    parity = parity + value;  // Accumulate parity
    value = value >> 1;       // Shift right to get next bit
    while (!HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for falling edge
    }

  while (HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for rising edge
  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_3, (parity & 0x01) ? GPIO_PIN_SET : GPIO_PIN_RESET); // set data to parity bit
  while (!HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for falling edge

  while (HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for rising edge
  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_3, GPIO_PIN_SET); // set data hi, stop bit
  while (!HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for falling edge

  while (HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for rising edge
  if (HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2) == true)
    lcd->info ("ps2send - missing line control bit");
  while (!HAL_GPIO_ReadPin (GPIOG, GPIO_PIN_2)) {} // wait for falling edge
  ps2rx = true;

  if (ps2get() != 0xFA)
    lcd->info ("ps2send - no 0xFA ack");
  }
//}}}
//{{{
void ps2sendTouchpadSpecialCommand (uint8_t arg) {
// send touchpad special command sequence

  for (int i = 0; i < 4; i++) {
    ps2send (0xE8);   // touchpad setResolution
    ps2send ((arg >> (6-2*i)) & 3);
    }
  }
//}}}

//{{{
void initPs2gpio() {

  bitPos = -1;
  inPtr = 0;
  outPtr = 0;

  __HAL_RCC_GPIOG_CLK_ENABLE();

  // PS2 clock
  GPIO_InitTypeDef GPIO_Init_Structure;
  GPIO_Init_Structure.Mode = GPIO_MODE_IT_RISING;
  GPIO_Init_Structure.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Pull = GPIO_PULLUP;
  GPIO_Init_Structure.Pin = GPIO_PIN_2;
  HAL_GPIO_Init (GPIOG, &GPIO_Init_Structure);

  // PS2 data
  GPIO_Init_Structure.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_Init_Structure.Speed = GPIO_SPEED_FREQ_HIGH;
  GPIO_Init_Structure.Pull = GPIO_PULLUP;
  GPIO_Init_Structure.Pin = GPIO_PIN_3;
  HAL_GPIO_Init (GPIOG, &GPIO_Init_Structure);

  // Enable and set EXTI line 2 Interrupt to the lowest priority
  HAL_NVIC_SetPriority (EXTI2_IRQn, 2, 0);
  HAL_NVIC_EnableIRQ (EXTI2_IRQn);

  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_2, GPIO_PIN_SET);
  HAL_GPIO_WritePin (GPIOG, GPIO_PIN_3, GPIO_PIN_SET);
  HAL_Delay (100);
  }
//}}}
//{{{
void initPs2keyboard() {

  ps2send (0xFF);
  if (ps2get() != 0xAA)
    lcd->info ("initPs2keyboard - missing 0xAA reset");

  for (int i = 0; i < 8; i++) {
    ps2send (0xED); // send leds
    ps2send (i);
    HAL_Delay (100);
    }

  ps2send (0x0F2); // sendId
  lcd->info ("keyboard id " + hex (ps2get()) + hex(ps2get()));
  }
//}}}
//{{{
void initPs2touchpad() {

  ps2send (0xFF);  // Touchpad reset
  if (ps2get() != 0xAA)
    lcd->info ("initPs2touchpad - missing 0xAA reset");
  if (ps2get() != 0x00)
    lcd->info ("initPs2touchpad - missing 0x00 reset");

  //ps2sendTouchpadSpecialCommand (0x00);
  //ps2send (0xE9); // touchpad statusRequest prefixed by specialCommand
  //auto minor = ps2get();
  //ps2get();  // 0x47
  //auto major = ps2get();
  //lcd->info ("Identify " + hex (major & 0x0F) + "." + hex (minor) + " modelCode:" + hex (major >> 4));

  //ps2sendTouchpadSpecialCommand (0x02);
  //ps2send (0xE9); // touchpad statusRequest prefixed by specialCommand
  //auto capMsb = ps2get();
  //ps2get();  // 0x47
  //auto capLsb = PS2get();
  //lcd->info ("Capabilities " + hex ((capMsb << 8) | capLsb));

  //ps2sendTouchpadSpecialCommand (0x03);
  //ps2send (0xE9); // touchpad statusRequest prefixed by specialCommand
  //ps2send modelId1 = ps2get();
  //auto modelId2 = ps2get();
  //auto modelId3 = ps2get();
  //lcd->info ("ModelId " + hex ((modelId1 << 16) | (modelId2 << 8) | modelId3));

  ps2sendTouchpadSpecialCommand (0x80);
  ps2send (0xF3); // touchpad setSampleRate prefixed by specialCommand
  ps2send (0x14); // - setSampleRate = 20

  ps2send (0xF4); // touchpad enable streaming
  }
//}}}

static volatile DSTATUS Stat = STA_NOINIT;
//{{{
DSTATUS diskStatus() {

  return SD_GetStatus() == SD_TRANSFER_OK ? 0 : STA_NOINIT;
  }
//}}}
//{{{
DSTATUS diskInitialize() {

  return SD_GetStatus() == SD_TRANSFER_OK ? 0 : STA_NOINIT;
  }
//}}}
//{{{
DRESULT diskIoctl (BYTE cmd, void* buff) {

  DRESULT res = RES_ERROR;

  switch (cmd) {
    // Make sure that no pending write process
    case CTRL_SYNC :
      res = RES_OK;
      break;

    // Get number of sectors on the disk (DWORD)
    case GET_SECTOR_COUNT : {
      HAL_SD_CardInfoTypedef CardInfo;
      SD_GetCardInfo (&CardInfo);
      *(DWORD*)buff = CardInfo.CardCapacity / SECTOR_SIZE;
      res = RES_OK;
      break;
      }

    // Get R/W sector size (WORD)
    case GET_SECTOR_SIZE :
      *(WORD*)buff = SECTOR_SIZE;
      res = RES_OK;
      break;

    // Get erase block size in unit of sector (DWORD)
    case GET_BLOCK_SIZE :
      *(DWORD*)buff = SECTOR_SIZE;
      res = RES_OK;
      break;

    default:
      res = RES_PARERR;
    }

  return res;
  }
//}}}
//{{{
DRESULT diskRead (BYTE* buffer, DWORD sector, UINT count) {

  if ((uint32_t)buffer & 0x03) {
    lcd->info ("diskRead align b:" + hex ((int)buffer) + " sec:" + dec (sector) + " num:" + dec (count));

    // not 32bit aligned, dma fails,
    auto tempBuffer = (uint8_t*)pvPortMalloc (count * SECTOR_SIZE);

    // read into 32bit aligned tempBuffer
    auto result = SD_ReadCached (tempBuffer, sector, count) == MSD_OK ? RES_OK : RES_ERROR;
    memcpy (buffer, tempBuffer, count * SECTOR_SIZE);

    vPortFree (tempBuffer);
    return result;
    }

  else {
    //lcd->info ("diskRead - sec:" + dec (sector) + " num:" + dec (count));
    return SD_ReadCached ((uint8_t*)buffer, sector, count) == MSD_OK ? RES_OK : RES_ERROR;
    }
  }
//}}}
//{{{
DRESULT diskWrite (const BYTE* buffer, DWORD sector, UINT count) {
  return SD_WriteCached ((uint8_t*)buffer, (uint64_t)(sector * SECTOR_SIZE), count) == MSD_OK ? RES_OK : RES_ERROR;
  }
//}}}

