colinporth/stm32F429disco/Src/main.cpp
std::vector<std::string> mFileNames;
//{{{
void listDirectory (std::string directoryName, std::string ext) {

  //lcd->info ("dir " + directoryName);
  //lcd->render();

  cDirectory directory (directoryName);
  if (directory.getError()) {
    //{{{  open error
    lcd->info (COL_RED, "directory open error:"  + dec (directory.getError()));
    return;
    }
    //}}}

  cFileInfo fileInfo;
  while ((directory.find (fileInfo) == FR_OK) && !fileInfo.getEmpty()) {
    if (fileInfo.getBack()) {
      //debug (fileInfo.getName());
      }

    else if (fileInfo.isDirectory()) {
      listDirectory (directoryName + "/" + fileInfo.getName(), ext);
      }
    else if (fileInfo.matchExtension (ext.c_str())) {
      mFileNames.push_back (directoryName + "/" + fileInfo.getName());
      //lcd->info (fileInfo.getName());
      //lcd->render();
      }
    }
  }
//}}}
//{{{
int main() {

  HAL_Init();
  SystemClockConfig180();
  initDebugUart();
  BSP_PB_Init (BUTTON_KEY, BUTTON_MODE_GPIO);
  //configureDtrace4();
  SDRAMgpioInit();
  SDRAMbank1Init();
  SDRAMbank2Init();

  HeapRegion_t xHeapRegions[] = { {(uint8_t*)SDRAM_BANK2_ADDR + 0x400000, 0x400000 }, { nullptr, 0 } };
  heapInit (xHeapRegions);

  // clear frameBuffer
  memset ((void*)SDRAM_BANK2_ADDR, 0, 0x400000);

  lcd = new cLcd (SDRAM_BANK2_ADDR, SDRAM_BANK2_ADDR + 0x200000);
  const std::string kHello = "built " + std::string(__TIME__) + " on " + std::string(__DATE__);
  lcd->init ("stm32F429disco test - " + kHello);
  lcd->displayOn();
  lcd->render();

  if (BSP_PB_GetState (BUTTON_KEY) == GPIO_PIN_SET) {
    //{{{  ps2
    initPs2gpio();
    initPs2touchpad();
    stream = true;
    }
    //}}}
  else {
    //{{{  sd
    int ret = SD_Init();
    lcd->info ("SDinit " + dec(ret));

    cFatFs* fatFs = cFatFs::create();
    if (fatFs->mount() != FR_OK)
      lcd->info ("fatFs mount problem");
    else
      lcd->info (fatFs->getLabel() + " vsn:" + hex (fatFs->getVolumeSerialNumber()) +
                 " freeSectors:" + dec (fatFs->getFreeSectors()));
    listDirectory ("", "JPG");
    }
    //}}}

  for (auto fileStr : mFileNames) {
    cFile file (fileStr, FA_OPEN_EXISTING | FA_READ);
    auto buf = (uint8_t*)pvPortMalloc (file.getSize());

    auto bytesRead = 0;
    FRESULT fresult = file.read (buf, file.getSize(), bytesRead);

    cJpegPic jpeg (2, buf);
    jpeg.readHeader();
    auto width = jpeg.getWidth();
    auto height = jpeg.getHeight();

    lcd->info (dec(file.getSize()) + " " + dec(width) + ":" + dec(height) + " " + fileStr);

    if ((width > 800) || (height > 600)) {
      auto out = jpeg.decodeBody (3);
      lcd->startRender();
      lcd->clear (COL_BLACK);
      lcd->copy (out, 0, 0, width>>3 , height>>3);
      lcd->endRender (true);
      vPortFree (out);
      }
    else {
      auto out = jpeg.decodeBody (0);
      lcd->startRender();
      lcd->clear (COL_BLACK);
      lcd->copy (out, 0, 0, width , height);
      lcd->endRender (true);
      vPortFree (out);
      }

    vPortFree (buf);
    }
  HAL_Delay (100000);

  while (true) {
    lcd->startRender();
    lcd->clear (COL_BLACK);
    //std::string str = "x:" + dec(touchX) + " y:" + dec(touchY) + " z:" + dec(touchZ);
    //lcd->text (COL_YELLOW, getFontHeight(), str, 100, 200, lcd->getLcdWidthPix(), getBoxHeight());
    auto x = lcd->getLcdWidthPix() - ((touchY-1300)/4);
    auto y = lcd->getLcdHeightPix() - ((touchX-1300)/4);
    lcd->ellipse (COL_YELLOW, x, y, touchZ, touchZ);
    lcd->endRender (true);
    //uint16_t value = PS2get();
    //char ch = (char)value;
    //std::string charStr (1, ch);
    //std::string releaseStr = (value & 0x100) ? " release " : " ";
    //lcd->info ("key:" + charStr + releaseStr + hex (value));
    }
  }
//}}}
